{
  "name": "Of a Lycantrope",
  "title": "Observations",
  "icon": "witchery:wolf_head",
  "category": "observations",
  "flag": "witcherycompanion:observations/add_werewolf",
  "sortnum": 1,
  "pages": [
    {
      "type": "text",
      "text": "I crept silently through the dense forest, my heart pounding from the pain in my leg, probably broken. I was walking through the forest looking for a village where I could find help. In a clearing, I spot a coven of six, maybe seven cloaked figures standing in a circle. The full moon cast an eerie glow upon the clearing. A black cat was resting on the shoulder of the person in the center."
    },
    {
      "type": "text",
      "text": "A shiver ran down my spine, as I began feeling a flow of a dark, mysterious energy around me. I hid behind a tree, barely breathing. The air crackled with dark energy. My leg stopped hurting for a few minutes."
    },
    {
      "type": "text",
      "text": "The person in the center began crying. Suddenly, their body contorted, bones snapping and reshaping. Fur grew fast on their body, teeth peaking from their mouth as their skull was changing form. A few minutes passed, and in place of the victim a wolf was standing. Still in pain, the wolf started roaring, sniffing and looking around with its glowing eyes."
    },
    {
      "type": "text",
      "text": "I knew I witnessed something terrible. I tried running, but I couldn't. I knew I was in danger with a wolf nearby who could smell my blood coming from the wound. The wolf ran away into a nearby cave, while I thought it was the safest option to climb a tree, which I did with great difficulty. I couldn't sleep for the rest of the night, so I started annotating on this diary everything worth of note. As the sun rose, a scream broke the silence, echoing from the cave. A man crawled out."
    },
    {
      "type": "text",
      "text": "The following night, what I feared happened. The man shape shifted into a wolf, again. This time I heard no screams. As soon as he transformed, he started sniffing and staring in my direction. In panic, I ran away as fast as I could. I crossed the nearby river and dug a hole to take refuge in, hoping I had covered my tracks."
    },
    {
      "type": "text",
      "text": "I continued observing the creature in both of their forms. As a human, he were naked, weak and helpless. As a wolf, he was strong, agile, and its confidence grew day by day. He wanted to control the transformation, and was obsessed in growing their strength as a wolf even more."
    },
    {
      "type": "text",
      "text": "Determined to control its fate, the werewolf embarked on a quest for power. Days turned into nights as it roamed the forest during the night and the nearby villages during the day, seeking knowledge. I watched, heart heavy with dread. One day, as a human, they rolled a giant rock just outside the cave, and started sculpting it. The following night, as a wolf, they killed three wolves and beheaded them. He placed the heads of the poor beasts on the statue."
    },
    {
      "type": "text",
      "text": "I watched in horror, paralyzed by fear. As they placed a strange plant on the Statue, a voice boomed from it in an unknown language. Laboring under the light of the full moon, the werewolf had constructed what seemed to be an altar. I will call the voice within the statue 'The deity', as the werewolf calls it. The deity, awakened by its efforts, bestowed tasks upon the creature. "
    },
    {
      "type": "text",
      "text": "The werewolf, driven by its primal instincts, completed each task with brutal efficiency. Upon completing each quest, the werewolf grew in strength. As days passed, the werewolf grew ever more powerful. Its senses heightened, it became almost omniscient in the forest. I watched in horror, feeling its gaze upon me more and more each night. My wound was almost healed, and soon I would be able to escape without being noticed "
    },
    {
      "type": "text",
      "text": "The werewolf, driven by its primal instincts, completed each task with brutal efficiency. Upon completing each quest, the werewolf grew in strength. As days passed, the werewolf grew ever more powerful. Its senses heightened, it became almost omniscient in the forest. I watched in horror, feeling its gaze upon me more and more each night. My wound was almost healed, and soon I would be able to escape without being noticed "
    },
    {
      "type": "text",
      "text": "Tonight is the night. The thin crescent moon lights the way. A full moon would give me more light, but it would grant the wolf even greater power. The werewolf is not in the cave, and does not appear to be anywhere near. The forest is full of creatures whose sounds will drown my escape. My heart has begun to beat faster, my breathing is lighter and faster. I am ready."
    },
    {
      "type": "empty",
      "draw_filler": false
    },
    {
      "type": "text",
      "text": "He knew. He was waiting, he knew very well where I was hiding. As soon as I got down from the tree, he jumped on me. I'm losing blood, I know I'm going to die. I feel weird, all my bones hurt, I have trouble even writing. My mind is getting foggy. I feel like I can see hair growing on my sk-"
    }
  ]
}