{
  "name": "Altar",
  "icon": "witchery:altar",
  "category": "altar",
  "sortnum": 0,
  "read_by_default": true,
  "pages": [
    {
      "type": "text",
      "title": "Altar",
      "text": "The Altar is the main construct that witches use to focus and harness the magical essence of a nearby area into an usable source of power. Witchcraft uses the power of the nearby nature, thus a location that thrives with plant life is most ideal place where to build an Altar."
    },
    {
      "type": "multiblock",
      "name": "Altar",
      "multiblock": {
        "pattern": [["A0A", "AAA"]],
        "mapping": {
          "A": "witchery:altar",
          "0": "witchery:altar"
        },
        "symmetrical": true
      },
      "text": "The Altar is ready when a red carpet decoration is automatically placed on top of it."
    },
    {
      "type": "text",
      "title": "Using the Altar",
      "text": "A witch can check the amount of power the Altar has stored by right-clicking on it. Other information is also displayed, such as the maximum amount of power it can collect and how fast it recharges depleted power. Some witchcraft procedures require power, such as $(l:distilling/intro)Distilling$(/l), $(l:brewing/introduction)Brewing$(/l) and using the $(l:kettle/kettle_intro)Kettle$(/l)."
    },
    {
      "type": "text",
      "title": "Altar Power",
      "text": "The maximum amount of power an altar can store is determined by how much plant life there is around the Altar. Things like $(item)Trees$(), $(item)Crops$() and other $(item)Plants$() Even grass and dirt contribute, while stone and sand do not. It is worth noting more of the same plants won't contribute to Altar power after a certain treshold, thus it is important to have a great variety of species and plants around."
    },
    {
      "type": "text",
      "title": "Altar Range",
      "text": "The Altar has a fixed range in which it can collect power from nearby nature and distribute it. The range is around 14-16 blocks, but can be extended with the use of $(l:altar/altar_boosters)Altar Boosters$(/l). Keep in mind that devices can only draw power from a single altar, so it is important to upgrade one Altar rather than building multiple ones."
    }
  ]
}